#### Terraform Plan 📖

<details><summary>Show Plan</summary><br>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aws.aws_appautoscaling_policy.scale_down will be created
  + resource "aws_appautoscaling_policy" "scale_down" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "scale-down-policy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/application-container-cluster/background-workers"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type = "ChangeInCapacity"
          + cooldown        = 60

          + step_adjustment {
              + scaling_adjustment          = -1
                # (2 unchanged attributes hidden)
            }
        }
    }

  # module.aws.aws_appautoscaling_policy.scale_up will be created
  + resource "aws_appautoscaling_policy" "scale_up" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "scale-up-policy"
      + policy_type        = "StepScaling"
      + resource_id        = "service/application-container-cluster/background-workers"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type = "ChangeInCapacity"
          + cooldown        = 60

          + step_adjustment {
              + scaling_adjustment          = 1
                # (2 unchanged attributes hidden)
            }
        }
    }

  # module.aws.aws_cloudwatch_metric_alarm.scale_down will be created
  + resource "aws_cloudwatch_metric_alarm" "scale_down" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when SQS queue has atleast 1 message"
      + alarm_name                            = "background-workers-scale-down"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "background-jobs"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.aws.aws_cloudwatch_metric_alarm.scale_up will be created
  + resource "aws_cloudwatch_metric_alarm" "scale_up" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alarm when SQS queue has atleast 1 message"
      + alarm_name                            = "background-workers-scale-up"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "background-jobs"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.aws.aws_ecs_service.application_servers will be updated in-place
  ~ resource "aws_ecs_service" "application_servers" {
        id                                 = "arn:aws:ecs:us-west-2:170683628345:service/application-container-cluster/application-servers"
        name                               = "application-servers"
        tags                               = {}
        # (17 unchanged attributes hidden)

      + load_balancer {
          + container_name   = "rails"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:170683628345:targetgroup/rails-starter-target-group/0769cb0c4e8ba29d"
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

```

</details>